import React, {Component} from 'react';

export default class Agreement extends Component {
    render() {
        return (
            <div className="content">
                <h2>Пользовательское соглашение</h2>
                <p>Agreement: Настоящая Политика в области обработки персональных данных и конфиденциальности персональной информации (далее — Политика) действует в отношении всей информации, которую ООО «Сноб Медиа» и/или ее аффилированные лица, включая все лица, входящие в одну группу с ООО «Сноб Медиа», могут получить о пользователе во время использования им любого из сайтов, сервисов, служб, программ и продуктов ООО «Сноб Медиа» (далее — Сервисы),  а также в ходе исполнения ООО «Сноб Медиа» / его аффилированными лицами любых соглашений и договоров, заключенных с пользователем в связи с использованием Сервисов. Согласие пользователя на предоставление персональных данных (персональной информации), данное им в соответствии с настоящей Политикой в рамках отношений с одним из лиц, входящих в группу лиц ООО «Сноб Медиа», распространяется на все лица, входящие в данную группу лиц.</p>

                <p>Использование Сервисов означает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации, а именно на совершение действий, предусмотренных п. 3 ч. 1 ст. 3 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных" как без, так и с использованием средств автоматизации, и подтверждает, что, давая такое согласие, он действует свободно, своей волей и в своем интересе; в случае несогласия с этими условиями пользователь должен воздержаться от использования Сервисов.</p>

                <p>Персональная информация пользователей, которую получает и обрабатывает ООО «Сноб Медиа»</p>
                <p>В рамках настоящей Политики под «персональной информацией пользователя» понимаются:
                    Персональная информация, которую пользователь предоставляет о себе самостоятельно при регистрации (создании учетной записи) или в процессе использования Сервисов, включая персональные данные пользователя. Обязательная для предоставления Сервисов (оказания услуг) информация помечена специальным образом. Иная информация предоставляется пользователем на его усмотрение.
                    Данные, которые автоматически передаются Сервисам в процессе их использования с помощью установленного на устройстве пользователя программного обеспечения, в том числе IP-адрес, информация из cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам), время доступа, адрес запрашиваемой страницы.
                    Иная информация о пользователе, в случае, если ее сбор и/или предоставление определено в регулирующих документах отдельных Сервисов.
                    Настоящая Политика применима только к Сервисам ООО «Сноб Медиа». ООО «Сноб Медиа» не контролирует и не несет ответственность за сайты третьих лиц, на которые пользователь может перейти по ссылкам, доступным на сайтах ООО «Сноб Медиа». На таких сайтах у пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться иные действия.
                    ООО «Сноб Медиа»в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако ООО «Сноб Медиа» исходит из того, что пользователь предоставляет достоверную и достаточную персональную информацию по вопросам, предлагаемым в форме регистрации, что указанные им при регистрации персональные данные принадлежат лично ему и поддерживает эту информацию в актуальном состоянии. Риск предоставления недостоверной информации несет предоставивший ее пользователь.
                    Согласие пользователя на обработку персональных данных действует бессрочно с момента осуществления регистрации пользователя на сайте, и не требует периодического подтверждения. ООО «Сноб Медиа» будет хранить персональную информацию столько времени, сколько это необходимо для достижения цели, для которой она была собрана, или для соблюдения требований законодательства и нормативных актов.
                    Цели сбора и обработки персональной информации пользователей
                    ООО «Сноб Медиа» собирает, обрабатывает и хранит только те персональные данные, которые необходимы для предоставления Сервисов и оказания услуг (исполнения соглашений и договоров с пользователем), в строгом соответствии с действующим законодательством.
                    Персональную информацию пользователя ООО «Сноб Медиа» может использовать в следующих целях:
                    Идентификация стороны в рамках соглашений и договоров с ООО «Сноб Медиа»;
                    Обработка необходима для выполнения договорных обязательств ООО «Сноб Медиа» перед пользователем;
                    Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;
                    Улучшение качества Сервисов, удобства их использования, разработка новых Сервисов и услуг;
                    Таргетирование рекламных материалов;
                    Проведение статистических и иных исследований на основе обезличенных данных.
                    Условия обработки персональной информации пользователя и ее передачи третьим лицам
                    В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных Сервисов (например, блога), пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.
                    ООО «Сноб Медиа» вправе передать персональную информацию пользователя третьим лицам в следующих случаях:
                    Пользователь выразил свое согласие на такие действия;
                    Передача необходима в рамках использования пользователем определенного Сервиса либо для оказания услуги пользователю;
                    Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры;
                    Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;
                    В целях обеспечения возможности защиты прав и законных интересов ООО «Сноб Медиа» или третьих лиц в случаях, когда пользователь нарушает Условия использования сайта www.snob.ru (https://www.snob.ru/basement/term).
                    Изменение пользователем персональной информации
                    Пользователь может в любой момент изменить (обновить, дополнить) предоставленную им персональную информацию или ее часть, а также параметры ее конфиденциальности, воспользовавшись функцией редактирования персональных данных в разделе «Личный кабинет». Пользователь вправе требовать от ООО «Сноб Медиа» уточнения, блокирования или уничтожения (удаления) предоставленной им персональной информации или ее части в случае, если персональные данные являются неполными, устаревшими, неточными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав.
                    Меры, применяемые для защиты персональной информации пользователей:
                    ООО «Сноб Медиа» принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.
                    Изменение Политики конфиденциальности. Применимое законодательство
                    ООО «Сноб Медиа» имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее опубликования на сайте www.snob.ru, если иное не предусмотрено новой редакцией Политики. Действующая редакция всегда находится и доступна на странице сайта www.snob.ru по адресу www.snob.ru/basement/privacy.
                    К настоящей Политике и отношениям между пользователем и ООО «Сноб Медиа», возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.
                    При обработке персональных данных пользователей ООО «Сноб Медиа» руководствуется Федеральным законом РФ «О персональных данных».
                    Обратная связь. Вопросы и предложения
                    Все предложения или вопросы по поводу настоящей Политики следует сообщать в Службу поддержки пользователей, либо по адресу 119072, город Москва, а/я 36, для ООО «Сноб Медиа».</p>
            </div>
        )
    }
}